---
kind: method
id: M:Autodesk.Revit.DB.ParameterSet.Contains(Autodesk.Revit.DB.Parameter)
source: html/0a5baed4-452e-8416-0ad9-8c64744166c9.htm
---
# Autodesk.Revit.DB.ParameterSet.Contains Method

Tests for the existence of a parameter within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	Parameter item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Parameter`) - The parameter to be searched for.

## Returns
The Contains method returns True if the parameter is within the set, otherwise False.